app/controllers/playlists_controller.rb

  def index
      #here the values that we will share with view index
      #we add all the playlist object to instanceVariable
      @playlists = Playlist.all
---
SELECT "playlists".* FROM "playlists"

  def show

    @playlist = Playlist.find(params[:id])
---
SELECT  "playlists".* FROM "playlists" WHERE "playlists"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]

  def create
    #manda llamar a playlist_params para solo aceptar los parametros requeridos
    @playlist = Playlist.new(playlist_params)

    if @playlist.save #se valida que fue guardada
---
INSERT INTO "playlists" ("name", "number_of_votes") VALUES (?, ?)  [["name", "Otra lista"], ["number_of_votes", 4]]