app/controllers/tracks_controller.rb

SELECT "tracks".* FROM "tracks"
---
  def index
    #es el listado de todos los elementos
    @tracks = Track.all

INSERT INTO "tracks" ("title", "album", "artist", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "one"], ["album", "Metallica"], ["artist", "Metallica"], ["created_at", "2017-09-18 15:17:58.746554"], ["updated_at", "2017-09-18 15:17:58.746554"]]
---
  def create
    @track = Track.new(track_params)

    respond_to do |format|
      if @track.save

UPDATE "tracks" SET "artist" = ?, "updated_at" = ? WHERE "tracks"."id" = ?  [["artist", "Metallica!!"], ["updated_at", "2017-09-16 03:06:47.843811"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @track.update(track_params)

DELETE FROM "tracks" WHERE "tracks"."id" = ?  [["id", 3]]
---
  def destroy
    @track.destroy

SELECT  "tracks".* FROM "tracks" WHERE "tracks"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
    def set_track
      @track = Track.find(params[:id])